{"severity":2,"customFields":{},"description":"Case template to investigate and response Worm Infection by jonitampan\n\nWorm Infection Response\nGuidelines to handle information system Worm infections\nIRM Author: CERT SG/Vincent Ferran-Lacome\nIRM version: 1.3E-Mail: cert.sg@socgen.com\nWeb: https://cert.societegenerale.com\nTwitter: @CertSG","tags":["IR","virus","worm"],"name":"Worm Infection","tlp":2,"titlePrefix":"","metrics":{},"pap":2,"tasks":[{"order":0,"description":"Detect the infection. \nInformation coming from several sources should be gathered and analyzed:\n- Antivirus logs,\n- Intrusion Detection Systems,\n- Suspicious connection attemptson servers,\n- Highamountof accountslocked,\n- Suspicious network traffic,\n- Suspicious connection attempts in firewalls,\n- High increase of support calls,\n- High load or system freeze,\n- High volumes of e-mail sentIf  one  or  several  of  these  symptoms  have  been spotted, the actors defined in the “preparation” step will  get  in  touch  and if  necessary, create  a  crisis cell. \n\n","group":"Identification","title":"Detect the Infection"},{"order":1,"description":"Analyze  the  symptoms  to  identify  the  worm, its propagation vectors and countermeasures. Lead scan be found from:\n- CERT’s bulletins;\n- External support contacts (antivirus companies, etc.);\n- Security    websites(Secunia, SecurityFocus etc.)\nNotify Chief Information Security Officer.Contact your CERT if required. ","title":"Identify the infection","group":"Identification"},{"order":2,"description":"Define  the  boundaries  of  the  infection  (i.e.:  global infection, bounded to a subsidiary, etc.). If  possible, identify  the business impact  of  the infection.","title":"Assess the perimeter of the infection","group":"Identification"},{"order":3,"group":"Containment","description":"The  following  actions  should  be  performed  and monitored by the crisis management cell:\n\n\n\n1. Disconnect the infected area from the Internet.\n2. Isolate  the infected area.  Disconnect  it  from any network.\n3. If business-critical traffic cannot be disconnected,  allow itafter  ensuring  that it cannot  be  an  infection  vector or  find validated circumventions techniques.\n4. Neutralize     the     propagation     vectors. A propagation   vector   can   be   anything   from network   traffic   to   software   flaw.Relevant countermeasures  have  to  be  applied (patch, traffic blocking, disable devices, etc.) For  example,the  following  technique scan  be used: \n   - Patch deployment tools (WSUS), \n   - Windows GPO, \n   - Firewall rules, \n   - Operational procedures.\n5. Repeat  steps  2  to  4 on each  sub-area  of  the infected area until the worm stops spreading. If possible,  monitor  the  infection  using  analysis tools (antivirus  console,  server  logs,  support calls).\n\nThe spreading of the worm must be monitored.","title":"Mitigate Attack"},{"order":4,"group":"Containment","title":"Mitigate Attack - Mobile devices","description":"Make  sure  that  no  laptop,  PDA  or  mobile  storage can be used as a propagation vector by the worm.If possible, block all their connections.Ask end-users to follow directives precisely.At the end of this step, the infection should be contained."},{"order":5,"title":"Identify","group":"Remediation","description":"Identify tools and remediation methods.The following resources should be considered:\n\n-  Vendor fixes(Microsoft, Oracle, etc.)\n-  Antivirus signature database\n-  External support contacts\n-  Security websites\n\nDefine  a disinfection  process.  The  process  has to bevalidated  byan  external  structure,  like  your CERTfor example."},{"order":6,"title":"Test","group":"Remediation","description":"Test the disinfection process and make sure that it properly works without damaging any service."},{"order":7,"title":"Deploy","group":"Remediation","description":"Deploy  the  disinfection  tools.  Several  options  can be used:\n\n- Windows WSUS\n- GPO\n- Antivirus signature deployment\n- Manual disinfection\n\nWarning: some  worms  can  block  some  of  the remediation    deployment    methods.    If    so,    a workaround has to be found. Remediation  progress  should  be  monitored  by  the crisis cell. "},{"order":8,"title":"Verify","group":"Recovery","description":"Verify  all  previous  steps  have  been  done  correctly and  get  a  management  approval  before  following next steps. \n\n\n1. Reopen the network traffic that  was  used as a propagation method by the worm.\n1. Reconnect sub-areas together\n1. Reconnect the mobile laptops to the area\n1. Reconnect the area to your localnetwork\n1. Reconnect the area to the Internet \n\nAll  of  these  steps shall  be made  in  a  step-by-step manner and   a   technical   monitoring   shall   be enforced by the crisis team."},{"order":9,"group":"Aftermath","title":"Report","description":"A   crisis   report   should   be   written   and   made available   to   all   of   the   actors   of   the   crisis management cell.The following themes should be described:\n\n\n- Initial cause of the infection\n- Actions  and  timelines of  every  important event\n- What went right\n- What went wrong\n- Incident cost "},{"order":10,"group":"Aftermath","title":"Capitalize","description":"Actions to improve the worm infection management processes  should  be  defined  to  capitalize  on  this experience."}],"status":"Ok"}