{"severity":2,"customFields":{},"description":"Case template to investigate and response DDoS attacks","tags":["IR","DDoS"],"name":"DDoS","tlp":2,"titlePrefix":"IR","metrics":{},"pap":2,"tasks":[{"order":0,"group":"Identification","title":"Analyze the attack","description":"- Understand the logical flow of the DDoS attack and identify the infrastructure components affected by it.\n- Understand if youare the target of the attack or a collateral victim\n- Review  the  load  and  logfilesof  servers,  routers,  firewalls, applications, and other affected infrastructure.\n- Identify what aspects of the DDoS traffic differentiate it from benign traffic\n - Source IP addresses, AS, etc\n - Destination ports\n - URLs\n - Protocols flags\n- Network analysis tools can be used to review the traffic\n- Tcpdump, Tshark, Snort,Argus, Ntop, Aguri, MRTG\n- If possible, create a NIDS signature to focus to differentiate between benign and malicious traffic."},{"order":1,"group":"Identification","title":"Involve internal and external actors","description":"- Contact your internal teams to learn about their visibility into the attack.\n- Contact your ISP to ask for help.Be specific about the traffic you’d like to control:\n - Network blocks involved\n - Source IP addresses\n - Protocols\n- Notify your company’s executive and legal teams."},{"order":2,"group":"Identification","title":"Check the background","description":"- Find out whether the company received an extortion demand as a precursor to the attack.\n- Search if  anyone  would  have  any  interest  into  threatening your company\n - Competitors\n - Ideologically-motivated groups(hacktivists)\n - Former employees"},{"order":3,"group":"Containment","title":"Mitigate Attack","description":"- If  the  bottleneck  is  a  particular feature  of  an application, temporarily disable that feature.\n- Attempt  to  throttle  or  block  DDoS  traffic  as  close  to  the network’s   “cloud”   as   possible   via   a   router,   firewall,   load balancer, specialized device, etc.\n- Terminate  unwanted  connections  or  processes  on  servers and routers and tune their TCP/IP settings.\n- If possible, switch to alternate sites or networks using DNS or  another  mechanism.  Blackhole  DDoS  traffic  targeting  the original IPaddresses.\n- Set  up  an  alternate  communication  channel  between  you and  your  users/customers  (e.g.:  web  server,  mail  server,  voice server, etc.) \n- If possible, route traffic through a traffic-scrubbing service or product via DNS or routing changes (e.g.: sinkhole routing)\n- Configure  egress  filters  to  block  the  traffic  your  systems may send in response to DDoS traffic(e.g.: backsquatter traffic), to avoid adding unnecessary packets to the network.\n- In  case  of  an  extortionattempt,  tryto  buy  time  with  the fraudster. For  example,  explain  that  you  need  more  time  in order to get managementapproval.\n\n**If  the  bottleneck  is  at  the  ISP’s  side,  only  the ISP can take efficient actions. In that case, work closely with your ISP and make sure youshare information efficiently.**"},{"order":4,"group":"Remediation","title":"Stop Attack","description":"- Contact your ISP and make sure that it enforces remediation measures. For  information,  here  are some of the possible measures:\n - Filtering(if possible at level Tier1 or 2)\n - Traffic-scrubbing/Sinkhole/Clean-pipe-Blackhole Routing\n- If the  DDoS sponsors have been identified, consider involving law enforcement. \n\n_This  should be performed upon the direction of your company’s executive and legal teams._\n\n**\nTechnical remediation actions can mostly be enforced by your ISP.**"},{"order":5,"group":"Recovery","title":"Back to Operational","description":"**Assess the end of the DDoS condition**\n- Ensure    that    the    impacted    services    are reachable again.\n- Ensure  that  your  infrastructure performance  is back to your baseline performance.\n\n**\nRollback the mitigation measures**\n- Switch back traffic to your original network.\n- Restart stopped services.\n\n**Ensure  that  the  recovery-related  actions  are decided in accordance with the network teams. Bringing  up  services  could  have  unexpected side effects.**"},{"order":6,"group":"Aftermath","title":"Lesson Learned","description":"- Consider   what   preparation   steps   you   could have  taken  to  respond  to  the  incident  faster  or more effectively.\n- If  necessary,  adjust  assumptions  that  affected the decisions    made    during    DDoS    incident preparation.\n- Assess    the    effectiveness    of    your    DDoS response process, involving people and communications.\n- Consider  what  relationships  inside  and  outside your   organizations   could   help   you   with   future incidents.\n- Collaborate  with  legal  teams  if  a  legal  action  is in process"}],"status":"Ok"}